In [4]:
import pandas as pd
import numpy as np

In [2]:
pd.Series(data = None, index = None, dtype = None)

D:\Program Files (x86)\Anaconda\envs\TF2_gpu\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

Series([], dtype: float64)

In [6]:
pd.Series(np.arange(10), dtype = float)

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [9]:
pd.Series([6.7,5,4.3,10], index=[2,1,3,4])

2     6.7
1     5.0
3     4.3
4    10.0
dtype: float64

In [10]:
color_count = pd.Series({'red':100, 'blue':200, 'green': 500, 'yellow':1000})
color_count

red        100
blue       200
green      500
yellow    1000
dtype: int64

In [11]:
color_count.values

array([ 100,  200,  500, 1000], dtype=int64)

In [12]:
color_count.index

Index(['red', 'blue', 'green', 'yellow'], dtype='object')

In [13]:
color_count[2]

500

In [15]:
color_count[0]

100

In [16]:
pd.DataFrame(np.random.randn(2, 3))

          0         1         2
0  0.002702 -0.213992  0.521801
1 -0.032611 -1.318758 -0.457364

In [17]:
score = np.random.randint(40, 100, (10, 5))

In [18]:
score_df = pd.DataFrame(score)

In [19]:
score_df

    0   1   2   3   4
0  98  74  99  94  41
1  40  66  43  82  74
2  83  84  60  93  89
3  99  77  63  89  86
4  59  52  83  75  97
5  68  65  86  74  88
6  91  54  94  57  45
7  54  68  64  79  52
8  90  79  46  76  75
9  81  62  69  66  80

In [20]:
subjects = ["语文", "数学", "英语", "政治", "体育"]

In [21]:
stu = ["student"+str(i) for i in range(score_df.shape[0])] #score_df.shape = (10, 5)

In [22]:
data = pd.DataFrame(score, columns=subjects, index=stu)

In [23]:
data

          语文  数学  英语  政治  体育
student0  98  74  99  94  41
student1  40  66  43  82  74
student2  83  84  60  93  89
student3  99  77  63  89  86
student4  59  52  83  75  97
student5  68  65  86  74  88
student6  91  54  94  57  45
student7  54  68  64  79  52
student8  90  79  46  76  75
student9  81  62  69  66  80

In [32]:
data.index

Index(['student0', 'student1', 'student2', 'student3', 'student4', 'student5',
       'student6', 'student7', 'student8', 'student9'],
      dtype='object')

In [33]:
data.columns

Index(['语文', '数学', '英语', '政治', '体育'], dtype='object')

In [34]:
data.values

array([[98, 74, 99, 94, 41],
       [40, 66, 43, 82, 74],
       [83, 84, 60, 93, 89],
       [99, 77, 63, 89, 86],
       [59, 52, 83, 75, 97],
       [68, 65, 86, 74, 88],
       [91, 54, 94, 57, 45],
       [54, 68, 64, 79, 52],
       [90, 79, 46, 76, 75],
       [81, 62, 69, 66, 80]])

In [35]:
data.T

,student0,student1,student2,student3,student4,student5,student6,student7,student8,student9
语文,98,40,83,99,59,68,91,54,90,81
数学,74,66,84,77,52,65,54,68,79,62
英语,99,43,60,63,83,86,94,64,46,69
政治,94,82,93,89,75,74,57,79,76,66
体育,41,74,89,86,97,88,45,52,75,80

In [36]:
data.head()

          语文  数学  英语  政治  体育
student0  98  74  99  94  41
student1  40  66  43  82  74
student2  83  84  60  93  89
student3  99  77  63  89  86
student4  59  52  83  75  97

In [37]:
data.tail(5)

          语文  数学  英语  政治  体育
student5  68  65  86  74  88
student6  91  54  94  57  45
student7  54  68  64  79  52
student8  90  79  46  76  75
student9  81  62  69  66  80

In [38]:
stu = ["学生_" + str(i) for i in range(score_df.shape[0])]

In [41]:
data.index = stu

In [42]:
data.head()

      语文  数学  英语  政治  体育
学生_0  98  74  99  94  41
学生_1  40  66  43  82  74
学生_2  83  84  60  93  89
学生_3  99  77  63  89  86
学生_4  59  52  83  75  97

In [43]:
data.reset_index(drop = False)

  index  语文  数学  英语  政治  体育
0  学生_0  98  74  99  94  41
1  学生_1  40  66  43  82  74
2  学生_2  83  84  60  93  89
3  学生_3  99  77  63  89  86
4  学生_4  59  52  83  75  97
5  学生_5  68  65  86  74  88
6  学生_6  91  54  94  57  45
7  学生_7  54  68  64  79  52
8  学生_8  90  79  46  76  75
9  学生_9  81  62  69  66  80

In [44]:
data

      语文  数学  英语  政治  体育
学生_0  98  74  99  94  41
学生_1  40  66  43  82  74
学生_2  83  84  60  93  89
学生_3  99  77  63  89  86
学生_4  59  52  83  75  97
学生_5  68  65  86  74  88
学生_6  91  54  94  57  45
学生_7  54  68  64  79  52
学生_8  90  79  46  76  75
学生_9  81  62  69  66  80

In [45]:
data.reset_index(drop = True)

   语文  数学  英语  政治  体育
0  98  74  99  94  41
1  40  66  43  82  74
2  83  84  60  93  89
3  99  77  63  89  86
4  59  52  83  75  97
5  68  65  86  74  88
6  91  54  94  57  45
7  54  68  64  79  52
8  90  79  46  76  75
9  81  62  69  66  80

In [46]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                    'year': [2012, 2014, 2013, 2014],
                    'sale':[55, 40, 84, 31]})

In [47]:
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [48]:
df.set_index("year")

      month  sale
year
2012      1    55
2014      4    40
2013      7    84
2014     10    31

In [49]:
df.set_index(["year", "month"])

            sale
year month
2012 1        55
2014 4        40
2013 7        84
2014 10       31

In [52]:
df[0:3]

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84

In [61]:
df["month"][0]

1

In [62]:
df.loc[0, "year"]

2012

In [64]:
df.iloc[1][1]

2014

In [65]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [70]:
arrays = [[1, 1, 2, 2], ['red', 'blue', 'red', 'blue']]
pd.MultiIndex.from_arrays(arrays, names=('number', 'color'))

MultiIndex([(1,  'red'),
            (1, 'blue'),
            (2,  'red'),
            (2, 'blue')],
           names=['number', 'color'])

In [72]:
df.index.names

FrozenList([None])

In [77]:
array = [[1,2,3],[4,5,6]]

In [78]:
test = np.array(array)